{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "Перайсці ў GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Перайдзіце ў GitHub, каб стварыць асабісты токен доступу (PAT)",
			"Copy & Continue to GitHub": "Капіраваць і працягнуць у GitHub",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "URI сервера GitHub Enterprise не з'яўляецца дапушчальным URI: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Узніклі праблемы з уваходам? Жадаеце паспрабаваць іншы спосаб? ({0})",
			"No": "Не",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Адчыніце [{0}]({0}) у новай укладцы і ўстаўце свой аднаразовы код: {1}",
			"Sign in failed: {0}": "Не атрымалася ўвайсці: {0}",
			"Sign out failed: {0}": "Не атрымалася выйсці: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Уваход у сістэму для {0}…",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Каб завяршыць аўтэнтыфікацыю, перайдзіце на GitHub і ўстаўце прыведзены вышэй аднаразовы код.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Каб завяршыць праверку сапраўднасці, перайдзіце на GitHub, каб стварыць шлях да асабістага токена доступу, а затым устаўце асабісты токен доступу ў поле ўводу.",
			"Yes": "Так",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Вы яшчэ не завяршылі аўтарызацыю гэтага пашырэння для ўжывання GitHub. Ці жадаеце вы паспрабаваць іншы спосаб? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Ваш код: {0}",
			"device code": "код прылады",
			"local server": "лакальны сервер",
			"personal access token": "асабісты маркер доступу",
			"url handler": "апрацоўшчык URL-адрасоў"
		},
		"package": {
			"description": "Пастаўшчык аўтэнтыфікацыі GitHub",
			"displayName": "Праверка аўтэнтыфікацыі GitHub"
		}
	}
}