{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Прыклад",
			"Files by Extension": "Файлы па пашырэнню",
			"Files with Extension": "Файлы з пашырэннем",
			"Files with Multiple Extensions": "Файлы з некалькімі пашырэннямі",
			"Files with Path": "Файлы з шляхам",
			"Files with Siblings by Name": "Файлы з элементамі таго ж узроўню па імені",
			"Folder by Name (Any Location)": "Каталог па імені (любое масцазнаходжанне)",
			"Folder by Name (Top Level)": "Каталог па імені (верхні ўзровень)",
			"Folders with Multiple Names (Top Level)": "Каталогі з некалькімі імёнамі (верхні ўзровень)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Супаставіць усе файлы, якія адпавядаюць глабальнаму шаблону абсалютнага шляху ў іх шляху да мовы з зададзеным ідэнтыфікатарам.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Супаставіць усе файлы, якія адпавядаюць глабальнаму шаблону ў іх імені файла, з мовай з зададзеным ідэнтыфікатарам.",
			"Match a folder with a specific name in any location.": "Супаставіць каталог з пэўным іменем у любым месцы.",
			"Match a top level folder with a specific name.": "Супаставіць каталог верхняга ўзроўню з вызначаным іменем.",
			"Match all files of a specific file extension.": "Супаставіць усе файлы з пэўным пашырэннем файла.",
			"Match all files with any of the file extensions.": "Супаставіць усе файлы з любым з пашырэнняў файла.",
			"Match files that have siblings with the same name but a different extension.": "Супаставіць файлы з аднарангавымі элементамі з аднолькавым іменем, але іншым пашырэннем.",
			"Match multiple top level folders.": "Супаставіць некалькі каталогаў верхняга ўзроўню.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Знак, які ўжываецца аперацыйнай сістэмай для падзелу кампанентаў у шляхах да файлаў. Так сама мае псеўданім '/'.",
			"The current opened file": "Бягучы адчынены файл",
			"The current opened file relative to ${workspaceFolder}": "Бягучы адчынены файл адносна ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Імя бягучага адчыненага каталогу працоўнай вобласці файлаў без якіх-небудзь касых чорт (/).",
			"The current opened file's basename": "Асноўнае імя бягучага адчыненага файлу",
			"The current opened file's basename with no file extension": "Асноўнае імя бягучага адчыненага файлу без пашырэння",
			"The current opened file's dirname": "Імя каталогу бягучага адчыненага файлу",
			"The current opened file's dirname relative to ${workspaceFolder}": "Імя бягучага адчыненага файлу адносна ${workspaceFolder}",
			"The current opened file's extension": "Пашырэнне бягучага адчыненага файлу",
			"The current selected line number in the active file": "Нумар бягучага абранага радка ў актыўным файле",
			"The current selected text in the active file": "Бягучы вылучаны тэкст у актыўным файле",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Імя задачы першапачатковай зборкі. Калі няма задач першапачатковай зборкі, то адлюстроўваецца меню хуткага выбару для выбару задачы зборкі.",
			"The name of the folder opened in VS Code without any slashes (/)": "Імя каталогу, які адчынены ў VS Code, без якіх-небудзь касых чорт (/)",
			"The path of the folder opened in VS Code": "Шлях да каталогу, які адчынены ў VS Code",
			"The path where an extension is installed.": "Шлях, па якім пашырэнне усталяванае.",
			"The task runner's current working directory on startup": "Бягучы працоўны каталог сродку выканання задачы пры запуску",
			"Use the language of the currently active text editor if any": "Ужывайце мову бягучага актыўнага тэкставага сродку праўкі, калі такі маецца",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "умоўны падзельнік (' - '), які адклюстроўваецца толькі ў асяроддзі зменных са значэннямі",
			"an indicator for when the active editor has unsaved changes": "паказвае наяўнасць незахаваных змяненняў у актыўным сродку праўкі",
			"e.g. SSH": "напрыклад, SSH",
			"e.g. VS Code": "напрыклад, VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "шлях да працоўнай вобласці (напрыклад, /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "шлях да файла каталогу працоўнай вобласці, у якім знаходзіцца файл (напрыклад, /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "імя каталогу працоўнай вобласці, у якім знаходзіцца файл (напрыклад, myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "імя працоўнай вобласці з дадатковай падаленай назвай і індфкатарам працоўнай вобласці, калі прыдатна (напрыклад, myFolder, myRemoteFolder [SSH] ці myWorkspace (працоўная вобласць))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "скарочанае імя працоўнай вобласці без суфіксаў (напрыклад, myFolder ці myWorkspace)",
			"the file name (e.g. myFile.txt)": "імя файлу (напрыклад, myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "поўны шлях да файлу (напрыклад, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "поўны шлях да каталогу, у якім знаходзіцца файл (напрыклад, /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "імя актыўнай галіны ў актыўным сховішчы (напрыклад, main)",
			"the name of the active repository (e.g. vscode)": "імя актыўнага сховішча (напрыклад, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "імя каталогу, у якім знахдзіцца файл (напрыклад, myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "шлях да файлу адносна каталогу працоўнай вобласці (напрыклад, myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "шлях да каталогу, у якім знаходзіцца файл, адносна каталогу працоўнай вобласці (напрыклад, myFolder/myFileFolder)"
		},
		"package": {
			"description": "Прадстаўляе магчымасці (такія як IntelliSense і аўтаматычнае выпраўленне) для канфігурацыйных файлаў, такіх як файлы налад, файлы запуску і файлы рэкамендацый для пашырэнняў.",
			"displayName": "Змена канфігурацыі"
		}
	}
}