{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref '{0}' у '{1}' немагчыма вырашыць.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Прешапачатковае значэнне. Ужываецца ў прапановах.",
			"A descriptive title of the element.": "Апісальны загаловак элементу.",
			"A long description of the element. Used in hover menus and suggestions.": "Падрабязнае апісанне элементу. Ужываецца ў меню пры навядзенні курсора мышы і ў прапановах.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Супастаўленне назваў уласцівасцяў з масівам назваў уласцівасцяў, альбо са схемай. Масіў назваў уласцівасцяў азначае, што ўласцівасць, якая названая ў ключы, залежыць ад уласцівасцяў ў масіве, якія прысутнічаюць у аб'екце, каб быць дапушчальным. Калі значэнне з'яўляецца схемай, то схема прымяняецца да аб'екта толькі ў тым выпадку, калі ўласцівасць у ключы існуе ў аб'екце.",
			"A map of property names to schemas for each property.": "Супастаўленне назваў уласцівасцяў са схемамі для кожнай ўласцівасці.",
			"A map of regular expressions on property names to schemas for matching properties.": "Супастаўленне рэгулярных выразаў для назваў уласцівасцяў са схемамі для супастаўлення уласцівасцяў.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Лік, які павінен выразна дзяліць бягучае значэнне (гэта значыць не мець астатку).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Рэгулярны выраз для супастаўлення радка. Яно прывязана няяўна.",
			"A schema which must not match.": "Схема, якая не павінна супадаць.",
			"A unique identifier for the schema.": "Унікальны ідэнтыфікатар для схемы.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Асобнік масіва сапраўдны для \"contains\", калі хаця б адзін з яго элементаў сапраўдны для дадзенай схемы.",
			"An array of schemas, all of which must match.": "Масіў схем, усе з якіх павінны супадаць.",
			"An array of schemas, exactly one of which must match.": "Масіў схем, дзе роўна адзін з якіх павінен супадаць.",
			"An array of schemas, where at least one must match.": "Масіў схем, дзе хоць бы адзін павінен супадаць.",
			"An array of strings that lists the names of all properties required on this object.": "Масіў радкоў, у якім пералічаныя назвы ўсіх уласцівасцяў, якія патрэбныя для гэтага аб'екту.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Асобнік паспяхова правярае адпаведнасць гэтаму ключавому слову, калі яго значэнне роўнае значэнню ключавога слова.",
			"Array does not contain required item.": "Масіў не ўтрымлівае абавязковы элемента.",
			"Array has duplicate items.": "Масіў змяшчае элементы, якія паўтараюцца.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "У масіве занадта мала элементаў, якія адпавядаюць абмежаванню зместа. Чакаецца {0} ці больш.",
			"Array has too few items. Expected {0} or more.": "У масіве занадта мала элементаў. Чакаецца {0} ці больш",
			"Array has too many items according to schema. Expected {0} or fewer.": "У масіве занадта шмат элементаў у адпаведнасці са схемай. Чакаецца {0} ці менш.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "У масіве занадта шмат элементаў, якія адпавядаюць абмежаванню зместа. Чакаецца {0} ці менш.",
			"Array has too many items. Expected {0} or fewer.": "У масіве занадта шмат элементаў. Чакаецца {0} ці менш.",
			"Colon expected": "Чакаецца дзьвюхкроп'е",
			"Comments are not permitted in JSON.": "Каментары ў JSON забароненыя.",
			"Comments from schema authors to readers or maintainers of the schema.": "Каментары аўтараў схемы да чытачоў альбо да тых, хто суправаджае схемы.",
			"Configure": "Наладзіць",
			"Configured by extension: {0}": "Наладжваецца з дапамогай пашырэння: {0}",
			"Configured in user settings": "Наладжана ў карыстальніцкіх наладах",
			"Configured in workspace settings": "Наладжана ў наладах працоўнай вобласці",
			"Default value": "Першапачатковае значэнне",
			"Describes the content encoding of a string property.": "Апісвае кадоўку зместу ўласцівасці радка.",
			"Describes the format expected for the value.": "Апісвае фармат, які чакаецца для значэння.",
			"Describes the media type of a string property.": "Апісвае тып носьбіта ўласцівасці радка.",
			"Downloading schemas is disabled through setting '{0}'": "Спампоўка схем адключаная з дапамогай налады '{0}'",
			"Downloading schemas is disabled. Click to configure.": "Спампоўка схем адключаная. Націсніце, каб наладзіць.",
			"Draft-03 schemas are not supported.": "Схемы Draft-03 не падтрымліваецца.",
			"Duplicate anchor declaration: '{0}'": "Паўтарыць аб'яву прывязкі: '{0}'",
			"Duplicate object key": "Паўтарыць ключ аб'екта",
			"Either a schema or a boolean. If a schema, then used to validate all properties not matched by 'properties' or 'patternProperties'. If false, then any properties not matched by either will cause this schema to fail.": "Альбо схема, альбо лагічнае значэнне. Калі схема, то ўжываецца для праверкі ўсіх уласцівасцяў, якія не адпавядаюць 'properties' ці 'patternProperties'. Калі false, то любыя ўласцівасці, якія не адпавядаюць ні аднаму з іх, прывядуць да збою гэтай схемы.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Альбо радок аднаго з базавых тыпаў схемы (number, integer, null, array, object, boolean, string), альбо масіў радкоў, які вызначае падмноства гэтых тыпаў.",
			"End of file expected.": "Чакаецца канец файла",
			"Expected a JSON object, array or literal.": "Чакаецца аб'ект JSON, масіў або літарал.",
			"Expected comma": "Чакаецца коска",
			"Expected comma or closing brace": "Чакаецца коска ці зачыненая фігурная дужка",
			"Expected comma or closing bracket": "Чакаецца коска ці зачыненая дужка",
			"Failed to sort the JSONC document, please consider opening an issue.": "Не атрымалася парадкаваць дакумент JSON. Калі ласка, разгледзьце магчымасць адкрыцця праблемы.",
			"For arrays, only when items is set as an array. If it is a schema, then this schema validates items after the ones specified by the items array. If it is false, then additional items will cause validation to fail.": "Для масіваў, толькі калі элементы зададзены як масіў. Калі схема, то гэтая схема правярае элементы пасля тых, якія пазначаны ў масіве элементаў. Калі false, то дадатковыя элементы прывядуць да збою праверкі.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Для масіваў. Можа быць альбо схемай для праверкі кожнага элемента, альбо масівам схем для праверкі кожнага элемента па парадку (першая схема праверыць першы элемент, другая схема праверыць другі элемент і гэтак далей.",
			"If all of the items in the array must be unique. Defaults to false.": "Ці павінны ўсе элементы ў масіве быць унікальнымі. Першапачаткова false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Калі асобнік з'яўляецца аб'ектам, гэтае ключавое слова правярае, ці адпавядае кожная назва ўласцівасці ў экзэмпляры прадстаўленай схеме.",
			"Incorrect type. Expected \"{0}\".": "Няправільны тып. Чакалася: \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Няправільны тып. Чакалася значэнне тыпу {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Паказвае, што значэнне асобніка кіруецца выключна сутнасцю-уладальнікам.",
			"Invalid characters in string. Control characters must be escaped.": "Хібныя знакі ў радку. Знакі кіравання павінны быць экранаваныя.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Хібны фармат колеру. Ужывайце фармат #RGB, #RGBA, #RRGGBB ці #RRGGBBAA.",
			"Invalid escape character in string.": "Хібня экранаваныя знакі з радку.",
			"Invalid number format.": "Хібны фармат ліку.",
			"Invalid unicode sequence in string.": "Хібная паслядоўнасць юнікода з радку.",
			"Item does not match any validation rule from the array.": "Элемент не адпавядае ніводнаму правілу праверкі з масіву",
			"JSON Language Server": "Моўны сервер JSON",
			"JSON Outline Status": "Стан структуры JSON",
			"JSON Validation Status": "Стан праверкі JSON",
			"JSON schema cache cleared.": "Кэш схемы JSON ачышчаны.",
			"JSON schema configured": "Схема JSON наладжана",
			"JSON: Schema Resolution Error": "JSON: памылка дазволу схемы",
			"Learn more about JSON schema configuration...": "Дадатковыя звесткі пра канфігурацыі схемы JSON…",
			"Loading JSON info": "Загрузка звестак JSON",
			"Makes the maximum property exclusive.": "Робіць найбольшую ўласцівасць эксклюзіўнай.",
			"Makes the minimum property exclusive.": "Робіць найменьшую ўласцівасць эксклюзіўнай.",
			"Matches a schema that is not allowed.": "Адпавядае схеме, якая не дазволена",
			"Matches multiple schemas when only one must validate.": "Адпавядае некалькім схемам, калі патрабуецца праверка толькі адной.",
			"Missing property \"{0}\".": "Уласцівасць \"{0}\" адсутнічае.",
			"New array": "Новы масіў",
			"New object": "Новы аб'ект",
			"No Schema Validation": "Без праверкі схемы",
			"No schema configured for this file": "Для гэтага файла схема не наладжаная",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Не ўжываецца для праверкі. Размесціце тут укладзеныя схемы, на якія вы жадаеце спасылацца, у адпаведнасці з $ref.",
			"Object has fewer properties than the required number of {0}": "Аб'ект мае менш уласцівасцяў, чым патрэбная колькасць {0}",
			"Object has more properties than limit of {0}.": "Аб'ект мае больш уласцівасцяў, чым абмежаванне ў {0}",
			"Object is missing property {0} required by property {1}.": "Аб'екту не хапае ўласцівасці {0}, якая патрэбнае уласцівасці {1}",
			"Open Extension": "Адчыніць пашырэнне",
			"Open Settings": "Адчыніць налады",
			"Outline": "Структура",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Праблема з чытаннем зместу з '{0}': знойдзены UTF-8 з BOM, дазволены толькі UTF 8.",
			"Problems loading reference '{0}': {1}": "Праблемы з загрузкай спасылкі '{0}': {1}",
			"Property expected": "Уласцівасць, якая чакаецца",
			"Property keys must be doublequoted": "Ключы уласцівасцяў павінны быць заключаныя ў падвоеныя двукоссі",
			"Property {0} is not allowed.": "Уласцівасць {0} не дазволена.",
			"Reference a definition hosted on any location.": "Спасылка на вызначэнне, якая размешчаная ў любым месцазнаходжанні.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Прыклад значэнняў JSON, якія звязаныя з пэўнай схемай, з мэтай ілюстрацыі ўжывання.",
			"Schema Validated": "Схема праверана",
			"Select the schema to use for {0}": "Абярыце схему, якую вы будзеце ўжываць для {0}",
			"Show Schemas": "Адлюстраваць схемы",
			"Sort JSON": "Парадкаваць JSON",
			"String does not match the pattern of \"{0}\".": "Радок не адпавядае шаблону \"{0}\".",
			"String is longer than the maximum length of {0}.": "Радок даўжэй найбольшай даўжыні ({0}).",
			"String is not a RFC3339 date-time.": "Радок не з'яўляецца датай і часам RFC3339.",
			"String is not a RFC3339 date.": "Радок не з'яўляецца датай RFC3339.",
			"String is not a RFC3339 time.": "Радок не з'яўляецца часам RFC3339.",
			"String is not a URI: {0}": "Радок не з'яўляецца URI: {0}.",
			"String is not a hostname.": "Радок не з'яўляецца іменем вузла.",
			"String is not an IPv4 address.": "Радок не з'яўляецца адрасам IPv4.",
			"String is not an IPv6 address.": "Радок не з'яўляецца адрасам IPv6.",
			"String is not an e-mail address.": "Радок не з'яўляецца адрасам электроннай пошты.",
			"String is shorter than the minimum length of {0}.": "Радок карацей найменьшай даўжыні {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Укладзеная схема \"else\" ужываецца для праверкі пры збоі ўкладзенай схемы \"if\".",
			"The \"if\" subschema is used for validation when the \"if\" subschema succeeds.": "Укладзеная схема \"if\" ужываецца для праверкі, калі ўкладзеная схема \"if\" выканана паспяхова",
			"The maximum length of a string.": "Найбольшая даўжыня радка.",
			"The maximum number of items that can be inside an array. Inclusive.": "Найбольшая колькасць элементаў, якая можа знаходзіцца ўнутры масіва (уключна).",
			"The maximum number of properties an object can have. Inclusive.": "Найбольшая колькасць уласцівасцяў, якім можа валодаць аб'ект (уключна).",
			"The maximum numerical value, inclusive by default.": "Найбольшае лікавае значэнне (першапачаткова ўключна).",
			"The minimum length of a string.": "Найменшая даўжыня радка.",
			"The minimum number of items that can be inside an array. Inclusive.": "Найменшая колькасць элементаў, якія могуць знаходзіцца ўнутры масіва (уключна).",
			"The minimum number of properties an object can have. Inclusive.": "Найменшая колькасць уласцівасцяў, якімі можа валодаць аб'ект (уключна).",
			"The minimum numerical value, inclusive by default.": "Найменшае лікавае значэнне (першапачаткова ўключна).",
			"The schema to verify this document against.": "Схема для зверкі з дадзеным дакументам.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Схема ўжывае функцыі мета-схемы ({0}), якія яшчэ не падтрымліваюцца сродкам праверкі.",
			"The set of literal values that are valid.": "Набор дапушчальных літарных значэнняў.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Вынік праверкі укладзенай схемы \"if\" вызначае, якія з ключавых слоў \"then\" ці \"else\" будуць вылічаныя.",
			"Trailing comma": "Канчатковая коска",
			"URI expected.": "Чакаецца URI.",
			"URI is expected.": "Чакаецца URI.",
			"URI with a scheme is expected.": "Чакаецца URI з схемай.",
			"Unable to compute used schemas: No document": "Не атрымалася вылічыць схемы, якія ўжываюцца: няма дакумента",
			"Unable to compute used schemas: {0}": "Не атрымалася вылічыць схемы, якія ўжываюцца: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Не атрымалася загрузіць схему з '{0}'. Недаступная служба запыту схемы",
			"Unable to load schema from '{0}': No content.": "Не атрымалася загрузіць схему з '{0}': без зместу.",
			"Unable to load schema from '{0}': {1}.": "Не атрымалася загрузіць схему з '{0}': {1}.",
			"Unable to load {0}": "Не атрымалася загрузіць {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Не атрымалася аналізаваць змест з '{0}': памылка сінтаксічнага аналізу пры зрушэнні {1}.",
			"Unable to resolve schema. Click to retry.": "Не атрымалася вырашыць схему. Націсніце, каб паўтарыць спробу.",
			"Unexpected end of comment.": "Нечаканы канец каментара.",
			"Unexpected end of number.": "Нечаканы канец ліку.",
			"Unexpected end of string.": "Нечаканы канец радка.",
			"Value expected": "Чакаецца значэнне",
			"Value is above the exclusive maximum of {0}.": "Значэнне перавышае выключнае найбольшае значэнне {0}.",
			"Value is above the maximum of {0}.": "Значэнне перавышае найбольшае значэнне ({0}).",
			"Value is below the exclusive minimum of {0}.": "Значэнне ніжэй выключнага найменшага значэння {0}.",
			"Value is below the minimum of {0}.": "Значэнне ніжэй найменшага значэння {0}.",
			"Value is deprecated": "Састарэлае значэнне",
			"Value is not accepted. Valid values: {0}.": "Значэнне не прымаецца. Дапушчальныя значэнні: {0}.",
			"Value is not divisible by {0}.": "Значэнне не дзеліцца на {0}.",
			"Value must be {0}.": "Значэнне павінна быць {0}.",
			"multiple JSON schemas configured": "наладжана некалькі схем JSON",
			"no JSON schema configured": "схема JSON не наладжаная",
			"only {0} document symbols shown for performance reasons": "па меркаваннях прадукцыйнасці адлюстроўваюцца толькі знакі дакумента {0}"
		},
		"package": {
			"description": "Забяспечвае шырокую падтрымку мовы для файлаў JSON.",
			"displayName": "Магчымасці мовы JSON",
			"json.clickToRetry": "Націсніце, каб паўтарыць спробу.",
			"json.colorDecorators.enable.deprecationMessage": "Налада 'json.colorDecorators.enable' састарэла. Цяпер замест яго ўжываецца налада 'editor.colorDecorators'.",
			"json.colorDecorators.enable.desc": "Уключае ці адключае дэкаратары колеру",
			"json.command.clearCache": "Ачысціць кэш схемы",
			"json.command.sort": "Парадкаваць дакумент",
			"json.enableSchemaDownload.desc": "Калі гэтая налада усталяваная, дазволена атрыманне схем JSON з размяшчэнняў HTTP і HTTPS.",
			"json.format.enable.desc": "Уключыць ці адключыць першапачатковы модуль фарматавання JSON",
			"json.format.keepLines.desc": "Захоўваць усе існуючыя новыя радкі пры фарматавання.",
			"json.maxItemsComputed.desc": "Найбольшая колькасць вылічаных сімвалаў структуры дакумента і згортваемых абласцей (абмежавана па меркаваннях прадукцыйнасці).",
			"json.maxItemsExceededInformation.desc": "Паказваць апавяшчэнне, калі перавышана найбольшая колькасць сімвалаў структуры і абласцей згортвання.",
			"json.schemaResolutionErrorMessage": "Не атрымалася дазволіць схему.",
			"json.schemas.desc": "Сувязь схем з JSON-файламі ў бягучым праекце.",
			"json.schemas.fileMatch.desc": "Масіў масак файлаў для праверкі адпаведнасці пры дазволе файлаў JSON у схемы. У якасці падстаноўных знакаў могуць ужывацца '*' і '**'. Таксама могуць быць вызначаны маскі выключэння, і яны павінны пачынацца з '!'. Файл лічыцца адпаведным, калі ёсць хаця б адна адпаведная маска, а апошняя адпаведная маска не з'яўляецца маскай выключэння.",
			"json.schemas.fileMatch.item.desc": "Маска файла, якая можа ўтрымліваць '*' і '**', з якімі ўжываецца параўнанне пры дазволе JSON-файлаў у схемах. Калі маска пачынаецца з '!', яна вызначае маску выключэння.",
			"json.schemas.schema.desc": "Вызначэнне схемы для названага URL-адраса. Схему неабходна паказаць толькі, каб не звяртацца па URL-адрасу схемы.",
			"json.schemas.url.desc": "URL-адрас ці абсалютны шлях да схемы. Можа быць адносным шляхам (які пачынаюцца з './') у наладах працоўнай вобласці і каталогу працоўнай вобласці.",
			"json.tracing.desc": "Адсочвае сувязь паміж VS Code і моўным серверам JSON.",
			"json.validate.enable.desc": "Уключэнне ці адключэнне праверкі JSON."
		}
	}
}