{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "URL-адрасы дадзеных не з'яўляюцца дапушчальнай крыніцай выяў.",
			"Embedded SVGs are not a valid image source.": "Убудаваныя файлы SVG не з'яўляюцца дапушчальнай крыніцай выяў.",
			"Error parsing the when-clause:": "Памылка пры аналізе прапановы when:",
			"Images must use the HTTPS protocol.": "Выявы павінны ўжываць пратакол HTTPS.",
			"Language specific editor settings": "Налады сродку праўкі, якія вызначаюцца мовай",
			"Override editor settings for language": "Перавызначыць налады сродку праўкі для мовы",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Адносныя URL-адрасы значкоў патрабуюць, каб у файле package.json было паказана сховішча з пратаколам HTTPS.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Адносныя URL-адрасы выяў патрабуюць, каб у файле package.json было паказана сховішча з пратаколам HTTPS.",
			"Remove activation event": "Выдаліць падзеі актывацыі",
			"SVGs are not a valid image source.": "Файлы SVG не з'яўляюцца дапушчальнай крыніцай выяў.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Гэта падзея актывацыі можа быць выдаленая, паколькі VS Code стварае іх аўтаматычна з вашых аб'яваў аб даданні package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Гэта падзея актывацыі можа быць выдаленая для пашырэнняў, якія арыентаваныя на рухавік версіі ^1.75, паколькі VS Code стварае іх аўтаматычна з вашых аб'яваў аб даданні ў package.json.",
			"This activation event cannot be explicitly listed by your extension.": "Гэта падзея актывацыі не можа быць відавочна паказана вашым пашырэннем.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Гэтая прапанова не можа быць выкарыстаная, паколькі для гэтага пашырэння прадукт вызначае фіксаваны набор прапаноў API. Вы можаце праверыць сваё пашырэнне, але перад публікацыяй вы павінны звязацца з камандай VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Ужывацце актывацыі '*' звычайна з'яўляеццадрэннай ідэяй, паколькі гэтае ўплывае на прадукцыйнасць."
		},
		"package": {
			"description": "Прадстаўляе функцыі жанраў для распрацоўкі пашырэнняў.",
			"displayName": "Распрацоўка пашырэнняў"
		}
	}
}