{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"store\" — лагічны тэст для наступнай ацэнкі ў guard ці if().",
			"'from' expected": "Чакаецца 'from'",
			"'in' expected": "Чакаецца 'in'",
			"'through' or 'to' expected": "Чакаецца 'through' ці 'to'",
			"'{0}'": "'{0}'",
			"( expected": "Чакаецца '('",
			") expected": "Чакаецца ')'",
			"<undefined>": "<не вызначана>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "Правіла @font-face павінан вызначаць уласцівасці 'src' і 'font-family'.",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Спіс уласцівасцяў, якія не правяраюцца ў адпаведнасці з правілам `unknownProperties`.",
			"Adds quotes to a string.": "Дадае двукоссі да радка.",
			"Also define the standard property '{0}' for compatibility": "Таксама вызначаць стандартную ўласцівасць '{0}' для сумяшчальнасці",
			"Always define standard rule '@keyframes' when defining keyframes.": "Заўсёды вызначаць стандартнае правіла '@keyframes' пры вызначэнні ключавых кадраў.",
			"Always include all vendor specific properties: Missing: {0}": "Заўсёды указваць усе ўласцівасці, якія адносяцца да пэўнага пастаўшчыка: Адсутнічае: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Заўсёды ўключаць усе правілы, якія адносяцца да пэўнага пастаўшчыка: Адсутнічае: {0}",
			"Appends a single value onto the end of a list.": "Дадае адно значэнне ў канец спісу.",
			"Appends selectors to one another without spaces in between.": "Дадае селектары адзін да аднаго без прабелаў паміж імі.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Пазбягайце выкарыстання !important. Гэта сведчыць пра тое, што спецыфіка ўсяго CSS выйшла з-пад кантролю і мае патрэбу ў рэфактарынгу.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Пазбягайце выкарыстання 'float'. Значэння з коскай прыводзяць да далікатнасці CSS, якую лёгка зламаць, калі зменіцца адзін аспект макету.",
			"CSS Language Server": "Моўны сервер CSS",
			"CSS fix is outdated and can't be applied to the document.": "Выпраўленне CSS састарэла і не можа быць ужыта да дакумента.",
			"Causes one or more rules to be emitted at the root of the document.": "Прыводзіць да стварэння аднаго або некалькіх правілаў у каранёвай часткі дакумента.",
			"Changes one or more properties of a color.": "Змяняе адну ці некалькі уласцівасцяў колеру.",
			"Changes the alpha component for a color.": "Змяняе альфа-складнік для колеру.",
			"Changes the hue of a color.": "Змяняе адценне колеру.",
			"Combines several lists into a single multidimensional list.": "Аб'ядноўвае некалькі спісаў у адзіны шматмерны спіс.",
			"Converts a color into the format understood by IE filters.": "Пераўтварае колер у фармат, які разумее фільтр Internet Explorer.",
			"Converts a color to grayscale.": "Пераўтварае колер у адценні шэрага.",
			"Converts a string to lower case.": "Пераўтварае радок у ніжні рэгістр.",
			"Converts a string to upper case.": "Пераўтварае радок у верхні рэгістр.",
			"Converts a unitless number to a percentage.": "Пераўтварае беспамерны лік у адсотак.",
			"Creates a Color from hue, saturation, and lightness values.": "Стварае колер на аснове значэнняў адцення, насычанасці і светлаты.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Стварае колер на аснове значэнняў адцення, насычанасці, светлаты і альфа-складнік.",
			"Creates a Color from hue, white, and black values.": "Стварае колер на аснове значэнняў адцення, белага і чорнага.",
			"Creates a Color from lightness, a, and b values.": "Стварае колер на аснове значэнняў светлаты, a і b.",
			"Creates a Color from lightness, chroma, and hue values.": "Стварае колер на аснове значэнняў светлаты, каляровасці і адцення.",
			"Creates a Color from red, green, and blue values.": "Стварае колер на аснове значэнняў чырвонага, зялёнага і сіняга.",
			"Creates a Color from red, green, blue, and alpha values.": "Стварае колер на аснове значэнняў чырвонага, зялёнага, сіняга і альфа-складнік.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Стварае колер на аснове значэнняў адцення, насычанасці і светлаты іншага колеру.",
			"Creates a Color from the hue, white, and black values of another Color.": "Стварае колер на аснове значэнняў адцення, белага і чорнага іншага колеру.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Стварае колер на аснове значэнняў яркасці, a і b іншага колеру.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Стварае колер на аснове значэнняў яркасці, каляровасці і адцення іншага колеру.",
			"Creates a Color from the red, green, and blue values of another Color.": "Стварае колер на аснове значэнняў чырвонага, зялёнага і сіняга іншага колеру.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Стварае колер у пэўнай каляровай прасторы на аснове значэнняў чырвонага, зялёнага і сіняга.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Стварае колер у пэўнай каляровай прасторы на аснове значэнняў чырвонага, зялёнага і сіняга іншага колеру.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Вызначае складаныя аперацыі, якія могуць паўторна ўжывацца ва ўсіх табліцах стыляў.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Вызначае стылі, якія можна паўторна ўжываць ва ўсёй табліцы стыляў з дапамогай `@include`.",
			"Do not use duplicate style definitions": "Не ўжываць вызначэнні стыляў, якія паўтараюцца",
			"Do not use empty rulesets": "Не ўжываць пустыя наборы правілаў",
			"Do not use width or height when using padding or border": "Не паказваць шырыню ці вышыню пры ўжыванні водступу ці рамкі",
			"Dynamically calls a Sass function.": "Дынамічна выклікае функцыю Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Кожны цыкл, які задае `$var` для кожнага элемента ў спісе ці супастаўленні карце, затым выводзіць стылі, якія ў ім змяшчаюцца, ўжывая гэтае значэнне `$var`.",
			"Exposes the details of Sass’s inner workings.": "Раскрывае дэталі ўнутранай працы Sass.",
			"Extends $extendee with $extender within $selector.": "Пашырае $extender з $extender у $selector.",
			"Extracts a substring from $string.": "Вымае ўкладзены радок з $string.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "Не атрымалася прымяніць выпраўленне CSS да дакументу. Калі ласка, разгледзьце магчымасць адкрыцця праблемы з крокамі па ўзнаўленні.",
			"Finds the maximum of several numbers.": "Знаходзіць найбольшае значэнне з некалькіх лікаў.",
			"Finds the minimum of several numbers.": "Знаходзіць найменшае значэнне з некалькіх лікаў.",
			"Fluidly scales one or more properties of a color.": "Плыўнае маштабаванне аднаго ці некалькіх уласцівасцяў колеру.",
			"Folding Region End": "Канец вобласці згіну",
			"Folding Region Start": "Пачатак вобласці згіну",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Цыкл For, які паўторна выводзіць набор стыляў для кожнага `$var` у `from/through` ці `from/to`.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Стварыць новыя колеры на аснове існуючых, для спрашчэння стварэння каляровых тэм.",
			"Gets the blue component of a color.": "Атрымае сіні складнік колеру.",
			"Gets the green component of a color.": "Атрымае зялёны складнік колеру.",
			"Gets the hue component of a color.": "Атрымае складнік адцення колеру.",
			"Gets the lightness component of a color.": "Атрымае складнік светлаты колеру.",
			"Gets the opacity component of a color.": "Атрымае складнік непразрыстасці колеру.",
			"Gets the red component of a color.": "Атрымае чырвоны складнік колеру.",
			"Gets the saturation component of a color.": "Атрымае складнік насычанасці колеру.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Шаснаццатковыя колеры павінны складацца з трох, чатырох, шасці ці васьмі шаснаццатковых лікаў",
			"IE hacks are only necessary when supporting IE7 and older": "Узломы для Internet Explorer неабходныя толькі пры падтрымцы Internet Explorer 7 і больш старых версій",
			"Import statements do not load in parallel": "Інструкцыі імпартавання не загружаюцца паралельна",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Уключае цела, калі выраз не прымае значэнне `false` ці `null`.",
			"Includes the styles defined by another mixin into the current rule.": "Уключае стылі, якія вызначаныя іншым міксаваннем, у бягучае правіла.",
			"Increases or decreases one or more components of a color.": "Павялічвае або памяншае адзін ці некалькі складнікаў колеру.",
			"Inherits the styles of another selector.": "Успадкоўвае стылі іншага селектара.",
			"Inserts $insert into $string at $index.": "Устаўляе $insert ў $string па $index.",
			"Invalid number of parameters": "Хібная колькасць параметраў",
			"Joins together two lists into one.": "Аб'ядноўвае два спісу ў адзін.",
			"Lets you access and modify values in lists.": "Дазваляе атрымаць доступ да значэнняў у спісах і змяніць іх.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Загружае табліцу стыляў Sass і робіць даступнымі яе спалучэнні, функцыі і зменныя, калі гэтая табліца стыляў загружаецца з дапамогай правіла @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Загружае спалучэнні, функцыі і зменныя з іншых табліц стыляў Sass як 'modules', і аб'ядноўвае CSS з некалькіх табліц стыляў разам.",
			"Makes a color darker.": "Робіць колер цямнеё.",
			"Makes a color less saturated.": "Робіць колер меньш насычаным.",
			"Makes a color lighter.": "Робіць колер святлей.",
			"Makes a color more opaque.": "Робіць колер больш непразрыстым.",
			"Makes a color more saturated.": "Робіць колер больш насычаным.",
			"Makes a color more transparent.": "Робіць колер больш празрыстым.",
			"Makes it easy to combine, search, or split apart strings.": "Спрашчае аб'яднанне, пошук ці падзел радкоў на часткі.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Дазваляе шукаць значэнне, якое звязанае з ключом, на карце і многае іншае.",
			"Merges two maps together into a new map.": "Аб'ядноўвае два супастаўленні ў новае супастаўленне.",
			"Mix two colors together in a polar color space.": "Змяшаць два колеры разам у палярнай каляровай прасторы",
			"Mix two colors together in a rectangular color space.": "Змяшаць два колеры разам у прастакутнай каляровай прасторы.",
			"Mixes two colors together.": "Змешвае два колеры разам.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Укладвае селектары адзін пад адным так, як яны былі б ўкладзеныя ў табліцу стыляў.",
			"No unit for zero needed": "Адзінка вымярэння для нуля не патрабуецца",
			"Parses a selector into the format returned by &.": "Пераўтворыць селектар ў фармат, які вяртаецца &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Выводзіць значэнне выразу ў стандартны паток вываду памылак. Карысна для адладкі складаных файлаў Sass.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Выводзіць значэнне выразу ў стандартны паток вываду памылак. Карысна для бібліятэк, якім неабходна папярэджваць карыстальнікаў аб састарэнні ці аднаўленні пасля нязначных памылак пры ўжыванні змешвання. Папярэджанні можна адключыць з дапамогай параметру каманднага радка `--quiet` ці налады Sass `:quiet`.",
			"Property is ignored due to the display.": "Уласцівасць ігнаруецца з-за адлюстравання.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Уласцівасць ігнаруецца з-за адлюстравання. Пры параметры 'display: block' выраўноўванне па вертыкалі ўжываць не варта.",
			"Provides access to Sass’s powerful selector engine.": "Забяспечвае доступ да магутнага апрацоўшчыка выбару Sass.",
			"Provides functions that operate on numbers.": "Прадастаўляе функцыі, якія працуюць з лікамі.",
			"Removes quotes from a string.": "Выдаляе двукоссі з радка.",
			"Rename to '{0}'": "Пераназваць на '{0}'",
			"Replaces $original with $replacement within $selector.": "Замяняе $original на $replacement у $selector.",
			"Replaces the nth item in a list.": "Замяняе n-й элемент у спісе.",
			"Returns a list of all keys in a map.": "Вяртае спіс усіх ключоў на супастаўленні.",
			"Returns a list of all values in a map.": "Вяртае спіс усіх значэнняў на супастаўленні.",
			"Returns a new map with keys removed.": "Вяртае новую супастаўленне з выдаленымі ключамі.",
			"Returns a random number.": "Вяртае выпадковы лік.",
			"Returns a specific item in a list.": "Вяртае пэўны элемент у спісе.",
			"Returns the absolute value of a number.": "Вяртае абсалютнае значэнне ліку.",
			"Returns the complement of a color.": "Вяртае дадатак да колеру.",
			"Returns the index of the first occurance of $substring in $string.": "Вяртае індэкс першага ўваходжання $substring у $string.",
			"Returns the inverse of a color.": "Вяртае інверсны колер.",
			"Returns the keywords passed to a function that takes variable arguments.": "Вяртае ключавыя словы, якія перададзеныя функцыі, якая прымае зменныя аргументы.",
			"Returns the length of a list.": "Вяртае даўжыню спіса.",
			"Returns the number of characters in a string.": "Вяртае колькасць знакаў у радку.",
			"Returns the position of a value within a list.": "Вяртае пазіцыю значэння ў спісе.",
			"Returns the separator of a list.": "Вяртае падзельнік спісу.",
			"Returns the simple selectors that comprise a compound selector.": "Вяртае простыя селектары, якія ўтрымліваюць складовы селектар.",
			"Returns the string representation of a value as it would be represented in Sass.": "Вяртае радковае ўяўленне значэння ў тым выглядзе, у якім яно было б прадстаўлена ў Sass.",
			"Returns the type of a value.": "Вяртае тып значэння.",
			"Returns the unit(s) associated with a number.": "Вяртае адзінкі вымярэння, якія звязаныя з лікам.",
			"Returns the value in a map associated with a given key.": "Вяртае значэнне ў супастаўленні, якое звязанае з зададзеным ключом.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Вяртае, ці адпавядае $super ўсім элементам, якія выконваюць $sub, і, магчыма, большай колькасці.",
			"Returns whether a feature exists in the current Sass runtime.": "Вяртае, ці існуе функцыя ў бягучым асяроддзі выканання Sass.",
			"Returns whether a function with the given name exists.": "Вяртае, ці існуе функцыя з зададзеным іменем.",
			"Returns whether a map has a value associated with a given key.": "Вяртае, ці мае супастаўленне значэнне, якое звязанае з дадзеным ключом.",
			"Returns whether a mixin with the given name exists.": "Вяртае, ці існуе змешванне з зададзеным іменем.",
			"Returns whether a number has units.": "Вяртае, ці ўтрымоўвае лік адзінкі вымярэння.",
			"Returns whether a variable with the given name exists in the current scope.": "Вяртае, ці існуе пераменная з зададзеным іменем у бягучай вобласці бачнасці.",
			"Returns whether a variable with the given name exists in the global scope.": "Вяртае, ці існуе пераменная з зададзеным іменем у глабальнай вобласці бачнасці.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Вяртае, ці можна скласці, адняць ці параўнаць два ліка.",
			"Rounds a number down to the previous whole number.": "Акругляе лік у меншы бок да папярэдняга цэлага ліку.",
			"Rounds a number to the nearest whole number.": "Акругляе лік да бліжэйшага цэлага ліку.",
			"Rounds a number up to the next whole number.": "Акругляе лік да наступнага цэлага ліку.",
			"Sass documentation": "Дакументацыя пра Sass",
			"Selector Specificity": "Спецыфічнасць селектара",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Селектары не павінны ўтрымліваць ідэнтыфікатары, паколькі дадзеныя правілы занадта цесна звязаныя з HTML.",
			"The universal selector (*) is known to be slow": "Вядома, што універсальны селектар (*) працуе павольна",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Выдае значэнне выразу як фатальную памылку пры трасіроўцы стэка. Карысна для праверкі аргументаў у змешванні і функцыях.",
			"URI expected": "Чакаецца URI",
			"URL encodes a string": "URL-адрас кадуе радок",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Аб'ядноўвае два селектары для стварэння селектара, які адпавядае элементам, адпаведным абодвум.",
			"Unknown at-rule.": "Невядомы аператар at-rule.",
			"Unknown property.": "Невядомая ўласцівасць.",
			"Unknown property: '{0}'": "Невядомая ўласцівасць: '{0}'",
			"Unknown vendor specific property.": "Уласцівасць невядомага пэўнага пастаўшчыка.",
			"When using a vendor-specific prefix also include the standard property": "Пры ўжыванні прэфікса для пэўнага пастаўшчыка, таксама пакажыце стандартную ўласцівасць",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Пры ўжыванні прэфікса пэўнага для пастаўшчыка, пераканайцеся, што таксама ўключаны ўсе іншыя ўласцівасці, якія адносяцца да пэўнага пастаўшчыка",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Цыкл While, які прымае выраз і паўторна выводзіць укладзеныя стылі да таго часу, пакуль аператар не атрымае значэнне `false`.",
			"[ expected": "Чакаецца [",
			"] expected": "Чакаецца ]",
			"absolute value of a number": "абсалютнае значэнне ліку",
			"arccosine - inverse of cosine function": "арккосінус — зваротная функцыя косінуса",
			"arcsine - inverse of sine function": "арксінус — зваротная функцыя сінуса",
			"arctangent - inverse of tangent function": "арктангенс — зваротная функцыя тангенса",
			"argument from '{0}'": "аргумент з '{0}'",
			"at-rule or selector expected": "чакаецца аператар at-rule ці селектар",
			"at-rule unknown": "невядомы аператар at-rule",
			"bind the evaluation of a ruleset to each member of a list.": "прывязаць ацэнку набору правілаў да кожнага элементу спісу.",
			"calculates square root of a number": "вылічае квадратны корань з ліку",
			"colon expected": "чакаецца двукроп'е",
			"comma expected": "чакаецца коска",
			"condition expected": "чакаецца ўмова",
			"converts numbers from one type into another": "пераўтварае лікі з аднаго тыпу ў іншы",
			"converts to a %, e.g. 0.5 > 50%": "пераўтварае ў %, напрыклад 0,5 > 50%",
			"cosine function": "функцыя косінуса",
			"creates a #AARRGGBB": "стварае #AARRGGBB",
			"creates a color": "стварае колер",
			"dot expected": "чакаецца кропка",
			"escape string content": "змест экранаванага радка",
			"expression expected": "чакаецца выраз",
			"first argument modulus second argument": "другі аргумент модуля першага аргументу",
			"first argument raised to the power of the second argument": "першы аргумент, які ўзведзены у ступень другога аргументу",
			"generate a list spanning a range of values": "стварыць спіс, які ахоплівае дыяпазон значэнняў",
			"identifier expected": "чакаецца ідэнтыфікатар",
			"identifier or variable expected": "чакаецца ідэнтыфікатар ці зменная",
			"identifier or wildcard expected": "чакаецца ідэнтыфікатар ці падстаноўчы знак",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "убудаваны блок ігнаруецца з-за значэння з коскай. Калі 'float' мае значэнне, які адрозны ад 'none', поле перамяшчаецца, а 'display' апрацоўваецца як 'block'",
			"inlines a resource and falls back to `url()`": "убудоўвае рэсурс і вяртаецца да `url()`",
			"media query expected": "чакаецца запыт мультымедыя",
			"number expected": "чакаецца лік",
			"operator expected": "чакаецца аператар",
			"page directive or declaraton expected": "чакаецца дырэктыва старонкі ці дэкларацыя",
			"parses a string to a color": "пераўтворыць радок у колер",
			"percentage expected": "чакаецца адсотак",
			"property value expected": "чакаецца значэнне ўласцівасці",
			"remove or change the unit of a dimension": "выдаліць ці змяніць адзінку вымярэння",
			"return `@color` 10% points darker": "вярнуць `@color` на 10% цямней",
			"return `@color` 10% points less saturated": "вярнуць `@color` на 10% менш насынаным",
			"return `@color` 10% points less transparent": "вярнуць `@color` на 10% менш празрачным",
			"return `@color` 10% points lighter": "вярнуць `@color` на 10% святлей",
			"return `@color` 10% points more saturated": "вярнуць `@color` 10 % больш насычаным",
			"return `@color` 10% points more transparent": "вярнуць `@color` на 10% больш празрачным",
			"return `@color` with 50% transparency": "вярнуць `@color` з празрыстасцю 50%",
			"return `@color` with a 10 degree larger in hue": "вярнуць `@color` з павелічэннем адцення на 10 градусаў",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "вярнуць `@darkcolor`, калі `@color1 > 43% luma`, інакш вярнуць `@lightcolor`. Глядзіце заўвагі",
			"return a mix of `@color1` and `@color2`": "вярнуць змешванне `@color1` і `@color2`",
			"returns a grey, 100% desaturated color": "вяртае шэры, на 100% ненасычаны колер",
			"returns a value at the specified position in the list": "вяртае значэнне ў названай пазыцыі ў спісе",
			"returns one of two values depending on a condition.": "вяртае адно з двух значэнняў у залежнасці ад умовы.",
			"returns pi": "вяртае лік Пі",
			"returns the `alpha` channel of `@color`": "вяртае канал `alpha` з `@color`",
			"returns the `blue` channel of `@color`": "вяртае канал `blue` з `@color`",
			"returns the `green` channel of `@color`": "вяртае канал `green` з `@color`",
			"returns the `hue` channel of `@color` in the HSL space": "вяртае канал `hue` з `@color` у прасторы HSL",
			"returns the `hue` channel of `@color` in the HSV space": "вяртае канал `hue` з `@color` у прасторы HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "вяртае канал `lightness` з `@color` у прасторы HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "вяртае значэнне `luma` (яркасць успрымання) з `@color`",
			"returns the `red` channel of `@color`": "вяртае канал `red` з `@color`",
			"returns the `saturation` channel of `@color` in the HSL space": "вяртае канал `saturation` з `@color` у прасторы HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "вяртае канал `saturation` з `@color` у прасторы HSV",
			"returns the `value` channel of `@color` in the HSV space": "вяртае канал `value` з `@color` у прасторы HSV",
			"returns the lowest of one or more values": "вяртае найменшае з аднаго ці некалькіх значэнняў",
			"returns the number of elements in a value list": "вяртае колькасць элементаў у спісе значэнняў",
			"rounds a number to a number of places": "акругляе лік да пэўнай колькасці знакаў",
			"rounds down to an integer": "акругляе да цэлага ліку ў меншы бок",
			"rounds up to an integer": "акругляе да цэлага ліку ў большы бок",
			"selector expected": "чакаецца селектар",
			"semi-colon expected": "чакаецца кропка з коскай",
			"sine function": "функцыя сінусу",
			"string literal expected": "чакаецца радковы літарал",
			"string replace": "замена радка",
			"tangent function": "функцыя тангенсу",
			"term expected": "чакаецца тэрмін",
			"unknown keyword": "невядомае ключавое слова",
			"uri or string expected": "чакаецца URI ці радок",
			"variable name expected": "чакаецца імя зменнай",
			"variable value expected": "чакаецца значэнне зменнай",
			"whitespace expected": "чакаецца прабел",
			"wildcard expected": "чакаецца падстаноўчы знак",
			"{ expected": "Чакаецца {",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "Чакаецца }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "Налада 'css.colorDecorators.enable' састарэла. Цяпер замест яго ўжываецца налада 'editor.colorDecorators'.",
			"css.completion.completePropertyWithSemicolon.desc": "Устаўце кропку з коскай у канцы радка пры запаўненні уласцівасцяў CSS.",
			"css.completion.triggerPropertyValueCompletion.desc": "Першапачаткова VS Code актывуе завяршэнне значэння ўласцівасці пасля выбару ўласцівасці CSS. Ужывайце гэтую наладу, каб адключыць такія паводзіны.",
			"css.customData.desc": "Спіс адносных шляхоў да файлаў JSON, перад якім паказаны [фармат карыстальніцкіх дадзеных](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code загружае карыстальніцкія дадзеныя пры запуску, каб палепшыць падтрымку каскадных табліц стыляў для карыстальніцкіх уласцівасцяў (зменных), at-rules, псеўдакласаў і псеўдаэлементаў, якія паказаныя ў файлах JSON.\r\n\r\nШляхі да файлаў задаюцца адносна працоўнай вобласці, і ўлічваюцца толькі налады каталогаў працоўнай вобласці.",
			"css.format.braceStyle.desc": "Змясціце фігурныя дужкі на той жа радок, што і правілы (`collapse`), альбо змясціце фігурныя дужкі на ўласны радок (`expand`).",
			"css.format.enable.desc": "Уключыць ці выключыць стандартны фармат CSS.",
			"css.format.maxPreserveNewLines.desc": "Найбольшы лік парываў радкоў, якія захоўваюцца ў адным блоку, калі ўключаная налада `#css.format.preserveNewLines#`.",
			"css.format.newlineBetweenRules.desc": "Падзяліць наборы правілаў пустым радком.",
			"css.format.newlineBetweenSelectors.desc": "Падзяліць селектары новым радком.",
			"css.format.preserveNewLines.desc": "Ці варта захоўваць існуючыя парывы радкоў перад элементамі.",
			"css.format.spaceAroundSelectorSeparator.desc": "Пераканайцеся ў наяўнасці прабелаў вакол падзельнікаў селектара '>', '+', '~' (напрыклад, `a > b`).",
			"css.hover.documentation": "Паказваць дакументацыю па ўласцівасцях і значэнняў пры навядзенні курсору каскадных табліц стыляў.",
			"css.hover.references": "Адлюстроўваць спасылкі на MDN пры навядзенні курсора мышы ў CSS.",
			"css.lint.argumentsInColorFunction.desc": "Няправільная колькасць параметраў.",
			"css.lint.boxModel.desc": "Не ўжывайце параметры 'width' ці 'height' пры ўказанні параметраў 'padding' ці 'border'.",
			"css.lint.compatibleVendorPrefixes.desc": "Пры ўжыванні прэфіксу пастаўшчыка таксама паказвайце астатнія ўласцівасці пастаўшчыка.",
			"css.lint.duplicateProperties.desc": "Не ўжывайце паўторныя вызначэнні стыляў.",
			"css.lint.emptyRules.desc": "Не ўжывайце пустыя наборы правілаў.",
			"css.lint.float.desc": "Старайцеся не ўжываць элементы 'float'. Элементы 'float' могуць парушыць працу кода CSS, калі змяніць адзін з аспектаў разметкі.",
			"css.lint.fontFaceProperties.desc": "У правіле '@font-face' павінны быць вызначаныя ўласцівасці 'src' і 'font-family'.",
			"css.lint.hexColorLength.desc": "Шаснаццатковыя колеры павінны складацца з 3, 4, 6 ці 8 шаснаццатковых лікаў.",
			"css.lint.idSelector.desc": "Селектары не павінны ўтрымліваць ідэнтыфікатары, таму што гэтыя правілы занадта цесна звязаныя з HTML.",
			"css.lint.ieHack.desc": "Карысныя парады для Internet Explorer патрабуюцца толькі пры падтрымцы Internet Explorer 7 і больш ранніх версій.",
			"css.lint.importStatement.desc": "Аператары імпартавання не загружаюцца паралельна.",
			"css.lint.important.desc": "Старайцеся не ўжываць !important, бо гэта сведчыць пра тое, што ўвесь код CSS стаў некіравальным і яго трэба перапрацаваць.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "Уласцівасць было праігнараваная з-за значэння параметру 'display'. Напрыклад, пры ўказанні значэння 'display: inline' уласцівасці 'width', 'height', 'margin-top', 'margin-bottom' і 'float' не працуюць.",
			"css.lint.universalSelector.desc": "Універсальны селектар (*) працуе павольна.",
			"css.lint.unknownAtRules.desc": "Невядомы аператар at-rules.",
			"css.lint.unknownProperties.desc": "Невядомая ўласцівасць.",
			"css.lint.unknownVendorSpecificProperties.desc": "Невядомая ўласцівасць пастаўшчыка.",
			"css.lint.validProperties.desc": "Спіс уласцівасцяў, для якіх не правяраецца правіла 'unknownProperties'.",
			"css.lint.vendorPrefix.desc": "Пры ўжыванні прэфікса пастаўшчыка таксама паказвайце стандартную ўласцівасць.",
			"css.lint.zeroUnits.desc": "Для нуля не патрабуецца адзінка вымярэння.",
			"css.title": "CSS",
			"css.trace.server.desc": "Адсочвае абмен дадзенымі паміж VS Code і моўным серверам CSS.",
			"css.validate.desc": "Уключае ці адключае ўсе праверкі.",
			"css.validate.title": "Кіруе праверкай CSS і сур'ёзнасцю праблем.",
			"description": "Прадастаўляе шырокую падтрымку мовы для файлаў CSS, LESS і SCSS.",
			"displayName": "Магчымасці мовы CSS",
			"less.colorDecorators.enable.deprecationMessage": "Налада 'less.colorDecorators.enable' састарэла. Цяпер замест яго ўжываецца налада 'editor.colorDecorators'.",
			"less.completion.completePropertyWithSemicolon.desc": "Устаўце кропку з коскай у канцы радка пры запаўненні уласцівасцяў CSS.",
			"less.completion.triggerPropertyValueCompletion.desc": "Першапачаткова VS Code актывуе завяршэнне значэння ўласцівасці пасля выбару ўласцівасці CSS. Ужывайце гэтую наладу, каб адключыць такія паводзіны.",
			"less.format.braceStyle.desc": "Змясціце фігурныя дужкі на той жа радок, што і правілы (`collapse`), альбо змясціце фігурныя дужкі на ўласны радок (`expand`).",
			"less.format.enable.desc": "Уключыць ці адключыць стандартны фарматаўшчык LESS.",
			"less.format.maxPreserveNewLines.desc": "Найбольшы лік парываў радкоў, якія захоўваюцца ў адным блоку, калі ўключаная налада `#less.format.preserveNewLines#`.",
			"less.format.newlineBetweenRules.desc": "Падзяліць наборы правілаў пустым радком.",
			"less.format.newlineBetweenSelectors.desc": "Падзяліць селектары новым радком.",
			"less.format.preserveNewLines.desc": "Ці варта захоўваць існуючыя парывы радкоў перад элементамі.",
			"less.format.spaceAroundSelectorSeparator.desc": "Пераканайцеся ў наяўнасці прабелаў вакол падзельнікаў селектара '>', '+', '~' (напрыклад, `a > b`).",
			"less.hover.documentation": "Паказваць дакументацыю па ўласцівасцях і значэнняў пры навядзенні курсору LESS.",
			"less.hover.references": "Адлюстроўваць спасылкі на MDN пры навядзенні курсора мышы ў LESS.",
			"less.lint.argumentsInColorFunction.desc": "Няправільная колькасць параметраў.",
			"less.lint.boxModel.desc": "Не ўжывайце параметры 'width' ці 'height' пры ўказанні параметраў 'padding' ці 'border'.",
			"less.lint.compatibleVendorPrefixes.desc": "Пры ўжыванні прэфіксу пастаўшчыка таксама паказвайце астатнія ўласцівасці пастаўшчыка.",
			"less.lint.duplicateProperties.desc": "Не ўжывайце паўторныя вызначэнні стыляў.",
			"less.lint.emptyRules.desc": "Не ўжывайце пустыя наборы правілаў.",
			"less.lint.float.desc": "Старайцеся не ўжываць элементы 'float'. Элементы 'float' могуць парушыць працу кода CSS, калі змяніць адзін з аспектаў разметкі.",
			"less.lint.fontFaceProperties.desc": "У правіле '@font-face' павінны быць вызначаныя ўласцівасці 'src' і 'font-family'.",
			"less.lint.hexColorLength.desc": "Шаснаццатковыя колеры павінны складацца з 3, 4, 6 ці 8 шаснаццатковых лікаў.",
			"less.lint.idSelector.desc": "Селектары не павінны ўтрымліваць ідэнтыфікатары, таму што гэтыя правілы занадта цесна звязаныя з HTML.",
			"less.lint.ieHack.desc": "Карысныя парады для Internet Explorer патрабуюцца толькі пры падтрымцы Internet Explorer 7 і больш ранніх версій.",
			"less.lint.importStatement.desc": "Аператары імпартавання не загружаюцца паралельна.",
			"less.lint.important.desc": "Старайцеся не ўжываць !important, бо гэта сведчыць пра тое, што ўвесь код CSS стаў некіравальным і яго трэба перапрацаваць.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "Уласцівасць было праігнараваная з-за значэння параметру 'display'. Напрыклад, пры ўказанні значэння 'display: inline' уласцівасці 'width', 'height', 'margin-top', 'margin-bottom' і 'float' не працуюць.",
			"less.lint.universalSelector.desc": "Універсальны селектар (*) працуе павольна.",
			"less.lint.unknownAtRules.desc": "Невядомы аператар at-rules.",
			"less.lint.unknownProperties.desc": "Невядомая ўласцівасць.",
			"less.lint.unknownVendorSpecificProperties.desc": "Невядомая ўласцівасць пастаўшчыка.",
			"less.lint.validProperties.desc": "Спіс уласцівасцяў, для якіх не правяраецца правіла 'unknownProperties'.",
			"less.lint.vendorPrefix.desc": "Пры ўжыванні прэфікса пастаўшчыка таксама паказвайце стандартную ўласцівасць.",
			"less.lint.zeroUnits.desc": "Для нуля не патрабуецца адзінка вымярэння.",
			"less.title": "LESS",
			"less.validate.desc": "Уключае ці адключае ўсе праверкі.",
			"less.validate.title": "Кіруе праверкай LESS і ўзроўнем сур'ёзнасці праблем.",
			"scss.colorDecorators.enable.deprecationMessage": "Налада 'scss.colorDecorators.enable' састарэла. Цяпер замест яго ўжываецца налада 'editor.colorDecorators'.",
			"scss.completion.completePropertyWithSemicolon.desc": "Устаўце кропку з коскай у канцы радка пры запаўненні уласцівасцяў CSS.",
			"scss.completion.triggerPropertyValueCompletion.desc": "Першапачаткова VS Code актывуе завяршэнне значэння ўласцівасці пасля выбару ўласцівасці CSS. Ужывайце гэтую наладу, каб адключыць такія паводзіны.",
			"scss.format.braceStyle.desc": "Змясціце фігурныя дужкі на той жа радок, што і правілы (`collapse`), альбо змясціце фігурныя дужкі на ўласны радок (`expand`).",
			"scss.format.enable.desc": "Уключыць ці адключыць стандартны фарматаўшчык SCSS.",
			"scss.format.maxPreserveNewLines.desc": "Найбольшы лік парываў радкоў, якія захоўваюцца ў адным блоку, калі ўключаная налада `#scss.format.preserveNewLines#`.",
			"scss.format.newlineBetweenRules.desc": "Падзяліць наборы правілаў пустым радком.",
			"scss.format.newlineBetweenSelectors.desc": "Падзяліць селектары новым радком.",
			"scss.format.preserveNewLines.desc": "Ці варта захоўваць існуючыя парывы радкоў перад элементамі.",
			"scss.format.spaceAroundSelectorSeparator.desc": "Пераканайцеся ў наяўнасці прабелаў вакол падзельнікаў селектара '>', '+', '~' (напрыклад, `a > b`).",
			"scss.hover.documentation": "Паказваць дакументацыю па ўласцівасцях і значэннях пры навядзенні курсору SCSS.",
			"scss.hover.references": "Адлюстроўваць спасылкі на MDN пры навядзенні курсора мышы ў SCSS.",
			"scss.lint.argumentsInColorFunction.desc": "Няправільная колькасць параметраў.",
			"scss.lint.boxModel.desc": "Не ўжывайце параметры 'width' ці 'height' пры ўказанні параметраў 'padding' ці 'border'.",
			"scss.lint.compatibleVendorPrefixes.desc": "Пры ўжыванні прэфіксу пастаўшчыка таксама паказвайце астатнія ўласцівасці пастаўшчыка.",
			"scss.lint.duplicateProperties.desc": "Не ўжывайце паўторныя вызначэнні стыляў.",
			"scss.lint.emptyRules.desc": "Не ўжывайце пустыя наборы правілаў.",
			"scss.lint.float.desc": "Старайцеся не ўжываць элементы 'float'. Элементы 'float' могуць парушыць працу кода CSS, калі змяніць адзін з аспектаў разметкі.",
			"scss.lint.fontFaceProperties.desc": "У правіле '@font-face' павінны быць вызначаныя ўласцівасці 'src' і 'font-family'.",
			"scss.lint.hexColorLength.desc": "Шаснаццатковыя колеры павінны складацца з 3, 4, 6 ці 8 шаснаццатковых лікаў.",
			"scss.lint.idSelector.desc": "Селектары не павінны ўтрымліваць ідэнтыфікатары, таму што гэтыя правілы занадта цесна звязаныя з HTML.",
			"scss.lint.ieHack.desc": "Карысныя парады для Internet Explorer патрабуюцца толькі пры падтрымцы Internet Explorer 7 і больш ранніх версій.",
			"scss.lint.importStatement.desc": "Аператары імпартавання не загружаюцца паралельна.",
			"scss.lint.important.desc": "Старайцеся не ўжываць !important, бо гэта сведчыць пра тое, што ўвесь код CSS стаў некіравальным і яго трэба перапрацаваць.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "Уласцівасць было праігнараваная з-за значэння параметру 'display'. Напрыклад, пры ўказанні значэння 'display: inline' уласцівасці 'width', 'height', 'margin-top', 'margin-bottom' і 'float' не працуюць.",
			"scss.lint.universalSelector.desc": "Універсальны селектар (*) працуе павольна.",
			"scss.lint.unknownAtRules.desc": "Невядомы аператар at-rules.",
			"scss.lint.unknownProperties.desc": "Невядомая ўласцівасць.",
			"scss.lint.unknownVendorSpecificProperties.desc": "Невядомая ўласцівасць пастаўшчыка.",
			"scss.lint.validProperties.desc": "Спіс уласцівасцяў, для якіх не правяраецца правіла 'unknownProperties'.",
			"scss.lint.vendorPrefix.desc": "Пры ўжыванні прэфікса пастаўшчыка таксама паказвайце стандартную ўласцівасць.",
			"scss.lint.zeroUnits.desc": "Для нуля не патрабуецца адзінка вымярэння.",
			"scss.title": "SCSS (SASS)",
			"scss.validate.desc": "Уключае ці адключае ўсе праверкі.",
			"scss.validate.title": "Кіруе праверкай SCSS і ўзроўнем сур'ёзнасці праблем."
		}
	}
}